{
  "main": {
    "name":"M Tayyab",
    "occupation":"Web Devolper",
    "description":"An enthusiastic web designer and developer who works with extreme dedication to fulfill the expectation of client in order to satisfy client with my expertise.",
    "image":"profilepic.jpg",
    "bio":"I am an athlete at heart, with an entrepreneurial spirit, a knack for online security, and a passion for coding. Having returned from my year of traveling, I pursued my first development job to kick off my career. I was hired as a full stack developer by Shop Your Own Mortgage, where I still work today. Since beginning my career there, I have been given the opportunity to shift into cybersecurity for the company. I am currently working towards my Certified Ethical Hacker certification while working as a full stack developer and Data Scientist.",
    "contactmessage":"I design, Review and develop an attractive website and fully responsive website with great functionality and with the best services along with quality work and will surely stand up to client expectations. If you would like a hand with JavaScript developer, React developer, Redux developer, and Firebase at the backend of the web I'll get right on it",
    "email": "m.tayyab.gcuf@gmail.com",
    "phone": "03037902194",
    "address":{
      "street":"Gojra",
      "city":"Faislabad",
      "state":"Punjab",
      "zip": "52000"
    },
    "website": "",
    "resumedownload":"",
    "social":[
      {
        "name":"facebook",
        "url":"https://web.facebook.com/chtayyab.gujjar9494/",
        "className":"fa fa-facebook"
      },
      {
        "name":"twitter",
        "url":"http://twitter.com",
        "className":"fa fa-twitter"
      },
      {
        "name":"google-plus",
        "url":"http://googleplus.com/",
        "className":"fa fa-google-plus"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/muhammad-tayyab-947836170/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"http://instagram.com/",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"http://github.com/muhammadtayyabgujjar",
        "className":"fa fa-github"
      },
      {
        "name":"skype",
        "url":"http://skype.com",
        "className":"fa fa-skype"
      }
    ]
  },
  "resume":{
    "skillmessage":"I'm experienced with various technologies: React.js, Redux, React Routing, Enzyme, Jest, Formic, firebase database.I'm familiar with the latest JavaScript code, style & conventions and always keep up to date with React.js new API and I prefer working with designs under Bootstrap/ Material UI and some more attractive designing to create pixel-perfect UI",
    "education":[
      {
        "school":"Goverment College University Faislabad",
        "degree":"Bachelor in Computer Science",
        "graduated":"April 2020",
        "description":"Under the recommendation and Guidance of the Head Coach of the UVIC soccer team, I transferred to the University of GCUF. Here I took my Bachelors of Computer Science with a Software Engineering Specialty and achieved a much more thorough education in the underlying theory, concepts, and science behind more complex programming. It was here that I discovered my passion for scalable application programming (web and mobile), the security behind computer and application systems, and found that I have a knack for understanding complex algorithms. "
      },
      {
        "school":"Goverment College Gojra",
        "degree":"FSC (Pre-Engineering)",
        "graduated":"March 2016",
        "description":""
      }
    ],
    "work":[
      {
        "company":"MithaCloud",
        "title":"Senior Web Devolper",
        "years":"March 2018 - Present",
        "description":"For most of my time at Shop Your Own Mortgage, I have worked as a Full Stack Software Engineer. Here I have had the chance to dig in and get my hands dirty with all parts of our software. I have worked with our legacy Firebase backend, as well as built new node-based servers for new products. As well, I led the development of V2 of our mobile application written in React Native. I have worked extensively with React/Redux as well as with react hooks." 
      },
      {
        "company":"Fiver $ Upwork",
        "title":"Devolper and DataScientist",
        "years":"March 2017 - present",
        "description":"I'm a M Tayyab and am always interested in playing around with new technologies but these are the ones that have really won me over"
      }
    ],
    "skills":[
      {
        "name":"Web Design",
        "level":"90%"
      },
      {
        "name":"Web Developer",
        "level":"85%"
      },
      {
        "name":"ReactJs",
        "level":"95%"
      },
      {
        "name":"Data Analysis",
        "level":"75%"
      },
      {
        "name":"Redux",
        "level":"80%"
      },
      {
        "name":"Data Engineering",
        "level":"60%"
      },
      {
        "name":"Firebase",
        "level":"80%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"",
        "category":"My Travel Blog for my post-university travels",
        "image":"canadian-wanderlust.jpg",
        "url":"https://www.canadianwanderlust.com"
      },
      {
        "title":"Quiz App",
        "category":"This is Quiz App during the situation of Covid 19",
        "image":"fury-fighting-gear.jpg",
        "url":"http://typescriptquiz.surge.sh/"
      },
      {
        "title":"Expense Tracker",
        "category":"Expense Traccker app for comon use",
        "image":"original-thai-food.jpg",
        "url":"http://expense_appp.surge.sh/"
      },
      {
        "title":"Resume Website",
        "category":"A React based resume website template",
        "image":"fury-fighting-gear.jpg",
        "url":"https://onlinestore-22e59.web.app/"
      },
      {
        "title":"Smirkspace",
        "category":"Simple front end projects woth best design",
        "image":"smirkspace.jpg",
        "url":"https://sylanihomepage-5cdf9.web.app/assignment%203/index.html"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"I have had the opportunity to work with Tim on multiple occasions which has always been a pleasure. He is driven and motivated with a consistently positive attitude. Tim excels at communicating with others and is always willing to work hard until he solves the problem at hand.",
        "user":"Haris Ali... Web Devolper"
      },
      {
        "text":"That M Tayyab must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user":"Aftab Ahmad... impersonator"
      }
    ]
  }
}
